Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: != inequality
es: != distinto que

source: "-" is also taken literally when it is at the end of the list, just before the closing "]".
es: "-" también se trata literalmente cuando se encuentra al final de la lista, justo antes del carácter "]" final.

source: "@INC" locations of perl libraries
es: "@INC" ubicación de bibliotecas de Perl

source: "Content-Length: $byte_count"
es: "Content-Length: $numero_bytes"

source: "Hello, world"
es: "Hola a todos"

source: "Just Another Perl Hacker," a clever but cryptic bit of Perl code that when executed, evaluates to that string.
es: "Just Another Perl Hacker", un fragmento de código Perl que refleja astucia, aunque de forma críptica, y que cuando se ejecuta devuelve la cadena anterior.

source: "To delimit" really just means "to surround" or "to enclose" (like these parentheses are doing).
es: "Delimitar" significa simplemente "rodear" o "envolver" (lo que hacen estos paréntesis).

source: "We're really serious about reinventing everything that needs reinventing." --Larry Wall
es: "Cuando hablamos de reinventar todo lo que sea necesario, no lo decimos en broma." --Larry Wall

source: "\N{LATIN SMALL LIGATURE FI}" =~ /(f)(i)/i; # Doesn't match!
es: "\N{LATIN SMALL LIGATURE FI}" =~ /(f)(i)/i; # No hay coincidencia

source: "\N{LATIN SMALL LIGATURE FI}" =~ /[fi][fi]/i; # Doesn't match!
es: "\N{LATIN SMALL LIGATURE FI}" =~ /[fi][fi]/i; # No hay coincidencia

source: "\N{LATIN SMALL LIGATURE FI}" =~ /fi*/i; # Doesn't match!
es: "\N{LATIN SMALL LIGATURE FI}" =~ /fi*/i; # No hay coincidencia

source: "\N{LATIN SMALL LIGATURE FI}" =~ /fi/i; # Matches
es: "\N{LATIN SMALL LIGATURE FI}" =~ /fi/i; # Hay coincidencia

source: "aa" =~ /${a}/; # True
es: "aa" =~ /${a}/; # Verdadero

source: "aa" =~ /${b}/; # True
es: "aa" =~ /${b}/; # Verdadero

source: "aa0" =~ /${a}0/; # False!
es: "aa0" =~ /${a}0/; # ¡Falso!

source: "aa0" =~ /${b}0/; # True
es: "aa0" =~ /${b}0/; # Verdadero

source: "aa\x08" =~ /${a}0/; # True!
es: "aa\x08" =~ /${a}0/; # ¡Verdadero!

source: "aa\x08" =~ /${b}0/; # False
es: "aa\x08" =~ /${b}0/; # Falso

source: "code position" and "ordinal" mean the same thing as "code point".
es: Un "código de carácter" también se llama "posición de código" u "ordinal".

source: # $f implicitly closed here
es: # $f se cierra aquí implícitamente

source: # (they are still accessible as $Some::Module::stuff)
es: # (son accesibles mediante $Mi::Modulo::cosa)

source: # A "reverse comma operator".
es: # Un "operador coma inverso".

source: # Find a hex digit.
es: # Buscar un dígito hexadecimal.

source: # First capture (?(DEFINE) (?<EXAMPLE> 1 ) # Second capture )/x;
es: # Primera captura (?(DEFINE) (?<EJEMPLO> 1 ) # Segunda captura )/x;

source: # Functions and variables which are exported by default
es: # funciones y variables que se exportan de forma predeterminada

source: # Functions and variables which can be optionally exported
es: # funciones y variables que se exportan de forma opcional

source: # If so, return it...
es: # si es así, devolverlo...

source: # Inherit from Exporter to export functions and variables
es: # heredar de Exporter para exportar funciones y variables

source: # Install DBM Filters
es: # Instalar filtros DBM

source: # Is there an attribute of that name?
es: # ¿Existe un atributo con este nombre?

source: # Its title is My Body Is a Cage
es: # Título: Soy minero

source: # Pass 1 to check up one call level from here
es: # Primer barrido para comprobar un nivel de llamada superior desde aquí

source: # Remove qualifier from original method name...
es: # Eliminar el calificador del nombre original del método...

source: # SYNTAX ERROR HERE.
es: # ERROR DE SINTAXIS.

source: # Stat returns list value.
es: # stat devuelve una lista.

source: # The below doesn't match, and it isn't clear what $1 and $2 would
es: # En la siguiente comparación no hay coincidencia, y no está claro

source: # The file is at /etc/hostname
es: # Ruta del archivo: /etc/hostname

source: # The file is at mp3s/My-Body-Is-a-Cage.mp3
es: # Ruta del archivo: mp3/Soy-minero.mp3

source: # The file is located at /etc/hostname
es: # El archivo se encuentra en /etc/hostname

source: # This is a comment
es: # Esto es un comentario

source: # This loop reads from STDIN, and prints non-blank lines:
es: # Este bucle lee de STDIN e imprime las líneas que no estén vacías:

source: # We must also take care of not escaping the legitimate \\Y|
es: # También hay que tener cuidado de no marcar con un escape

source: # XXX - this is a terrible way to implement accessors, but it makes
es: # XXX - esta es una forma pésima de implementar métodos de acceso,

source: # a cheap and nasty way to break an email address up into parts
es: # manera rápida de descomponer una dirección de correo electrónico

source: # as Some::Module::func3()
es: # mediante Mi::Modulo::func3()

source: # be even if it did!!
es: # qué contendrían $1 y $2 aunque hubiera coincidencia

source: # before ---------------branch-reset----------- after
es: # antes -------------reinicio de rama--------- después

source: # callable as $priv_func->();
es: # puede llamarse mediante $func_priv->();

source: # do something here...
es: # hacer algo aquí...

source: # exported package globals go here
es: # las variables globales de paquete exportadas van aquí

source: # file-private lexicals go here, before any functions which use them
es: # las variables léxicas privadas del archivo van aquí, antes que las funciones que las usan

source: # first rebase
es: # primero reorganizar

source: # for a simple example.
es: # pero se puede usar. Veamos un ejemplo sencillo.

source: # here's a file-private function as a closure,
es: # aquí va una función privada del archivo, como clausura

source: # implies:
es: #implicará:

source: # make all your functions, whether exported or not;
es: # incorpore todas sus funciones, exportadas o no;

source: # more flexible:
es: # más flexible:

source: # non-exported package globals go here
es: # las variables globales de paquete no exportadas van aquí

source: # now use %hashsym normally, and you
es: # ahora use %sim_hash de la forma usual y

source: # remember to put something interesting in the {} stubs
es: # no olvide poner algo interesante entre {}

source: # same as map assignment above
es: # la misma asignación de antes

source: # sequence, hence the presence of '\\' in the conversion rules.
es: # la secuencia \\Y| válida (por eso usamos '\\' en las reglas de conversión).

source: # set the version for version checking
es: # establecer la versión para la comprobación de versión

source: # the Perlish post-condition way
es: # ahora con una condición posterior, al estilo Perl

source: # the traditional way
es: # la manera tradicional

source: # then "delete-and-push"
es: # después "eliminar y enviar cambios"

source: # this one isn't exported, but could be called directly
es: # esta no se exporta, pero puede llamarse directamente

source: # this would print with a linebreak in the middle
es: # esto imprimirá un salto de línea en la mitad de la frase

source: # will affect the caller's %another_hash
es: # afectará al hash %otro_hash del autor de la llamada

source: # you don't have to use the default $_ either...
es: # tampoco tiene que usar la variable $_ predeterminada...

source: $ end of string
es: $ final de una cadena

source: $ Match the end of the line (or before newline at the end)
es: $ Final de línea (o antes del carácter de nueva línea al final)

source: $ branch="$yourname/$some_descriptive_name"
es: $ rama="$nombre/$nombre_descriptivo"

source: $ git checkout $user/$topic
es: $ git checkout $usuario/$tema

source: $ git checkout -b $branch
es: $ git checkout -b $rama

source: $ git checkout -b $branch origin/$branch
es: $ git checkout -b $rama origin/$rama

source: $ git checkout committer/somework
es: $ git checkout contribuidor/trabajo

source: $ git config --global sendemail.smtpuser YOURUSERNAME@gmail.com
es: $ git config --global sendemail.smtpuser NOMBRE.USUARIO@gmail.com

source: $ git merge --no-ff --no-commit committer/somework
es: $ git merge --no-ff --no-commit contribuidor/trabajo

source: $ git push origin $user/$topic
es: $ git push origin $usuario/$tema

source: $ git push origin -u $branch
es: $ git push origin -u $rama

source: $ git push origin :$user/$topic
es: $ git push origin :$usuario/$tema

source: $ git push origin HEAD:$branch
es: $ git push origin HEAD:$rama

source: $ git send-email 0001-Rename-Leon-Brocard-to-Orange-Brocard.patch
es: $ git send-email 0001-Cambiar-nombre-de-Leon-Brocard-a-Orange-Brocard.patch

source: $#days # the last index of array @days
es: $#jornadas # el último índice del array @jornadas

source: $#whatever = -1;
es: $#algo = -1;

source: $+{foo} will be the same as $2, and $3 will contain 'z' instead of the opposite which is what a .NET regex hacker might expect.
es: $+{foo} será lo mismo que $2 y $3 contendrá 'z' en lugar de lo opuesto, que es lo que esperaría un hacker de expresiones regulares de .NET.

source: $@%&* dereference $$foo{bar} aka $foo->{bar}
es: $@%&* desreferenciar $$foo{bar} equivale a $foo->{bar}

source: $ALL_CAPS_HERE constants only (beware clashes with perl vars!)
es: $TODO_MAYUSCULAS Solo constantes (procure evitar conflictos con variables perl)

source: $Price = '$100'; # not interpolated
es: $precio = '$100'; # no se interpola

source: $Some_Caps_Here package-wide global/static
es: $Algunas_Mayusculas Ámbito global/estático de paquete

source: $Some_package::name = "fred";
es: $Un_paquete::nombre = "Pedro";

source: $^H{"myint/in_effect"} = 0;
es: $^H{"entero/in_effect"} = 0;

source: $^H{"myint/in_effect"} = 1;
es: $^H{"entero/in_effect"} = 1;

source: $_ = "The food is under the bar in the barn.";
es: $_ = "En la mesa, al mediodía, se come, y en el comedor se cena.";

source: $_ = "Food is on the foo table.";
es: $_ = "En el Comedor Principal el niño come espinacas.";

source: $_ = "I have 2 numbers: 53147";
es: $_ = "Tengo 2 números: 53147";

source: $_ = "The brown fox jumps over the lazy dog";
es: $_ = "El zorro marrón saltó sobre el perro perezoso";

source: $a += 1; # same as $a = $a + 1
es: $a += 1; # igual que $a = $a + 1

source: $a -= 1; # same as $a = $a - 1
es: $a -= 1; # igual que $a = $a - 1

# $a .= " "; # same as $a = $a . " ";
source: $a .= "\n"; # same as $a = $a . "\n";
es: $a .= "\n"; # igual que $a = $a . "\n";

source: $a = '(.)\1'; # Creates problems when concatenated.
es: $a = '(.)\1'; # Provoca problemas cuando se concatena.

source: $a =~ s/foo/bar/; # replaces foo with bar in $a
es: $a =~ s/foo/bar/; # reemplaza foo por bar en $a

source: $a =~ s/foo/bar/g; # replaces ALL INSTANCES of foo with bar in $a
es: $a =~ s/foo/bar/g; # reemplaza todas las coincidencias de foo por bar en $a

source: $b = '(.)\g{1}'; # Avoids the problems.
es: $b = '(.)\g{1}'; # Evita los problemas.

source: $bar = "some other value";
es: $bar = "otro valor";

source: $binary =~ s/\x00\x0F/\xFF\xF0/; # for the brave :)
es: $binario =~ s/\x00\x0F/\xFF\xF0/; # para valientes :)

source: $body = encode('UTF-8', $body);
es: $cuerpo_texto = encode('UTF-8', $cuerpo_texto);

source: $c->speak();
es: $c->decir();

source: $cage->print_info;
es: $minero->imprimir_info;

source: $class->new();
es: $clase->new();

source: $count = $string =~ /\d+/g;
es: $recuento = $cadena =~ /\d+/g;

source: $count = () = $string =~ /\d+/g;
es: $recuento = () = $cadena =~ /\d+/g;

source: $days # the simple scalar value "days"
es: $jornadas # el valor escalar único llamado "jornadas"

source: $days[28] # the 29th element of array @days
es: $jornadas[28] # el elemento número 29 del array @jornadas

source: $days{'Feb'} # the 'Feb' value from hash %days
es: $jornadas{'Feb'} # el valor 'Feb' del hash %jornadas

source: $element_count = scalar(@whatever);
es: $contador_elementos = scalar(@algo);

source: $fh = *STDOUT;
es: $id_archivo = *STDOUT;

source: $fh = \*STDOUT;
es: $id_archivo = \*STDOUT;

source: $fh = newopen('/etc/passwd');
es: $id_archivo = nuevoopen('/etc/passwd');

source: $fh->autoflush();
es: $archivo->autoflush();

source: $fh->print('content');
es: $archivo->print('contenido');

source: $field = $query->radio_group( name => 'group_name', values => ['eenie','meenie','minie'], default => 'meenie', linebreak => 'true', labels => \%labels
es: $campo = $consulta->opciones( name => 'nombre_grupo', values => ['panchos','sanchos','juanchos'], default => 'sanchos', linebreak => 'true', labels => \%etiquetas

source: $file->$method();
es: $archivo->$metodo();

source: $file->$sub();
es: $archivo->$sub();

source: $file->${ \'save' };
es: $archivo->${ \'guardar' };

source: $file->${ \( returns_scalar() ) };
es: $archivo->${ \( devuelve_escalar() ) };

source: $file->${ returns_scalar_ref() };
es: $archivo->${ devuelve_ref_a_escalar() };

source: $file->${ returns_sub_ref() };
es: $archivo->${ devuelve_ref_a_sub() };

source: $file->print_info("The file is located at ");
es: $file->imprimir_info("El archivo se encuentra en ");

source: $file->print_info;
es: $archivo->imprimir_info;

source: $foo = @foo; # $foo gets 3
es: $foo = @foo; # se asigna 3 a $foo

source: $fruit_color{"apple"}; # gives "red"
es: $color_fruta{"manzana"}; # devuelve "rojo"

source: $gollum = new Pathetic::Creature "Smeagol";
es: $gollum = new Criatura::Lamentable "Smeagol";

source: $hash{"$key\0"} = "$value\0";
es: $hash{"$clave\0"} = "$valor\0";

source: $hash{12345} = "something";
es: $hash{12345} = "algo";

source: $here = Cwd::getcwd();
es: $directorio = Cwd::getcwd();

source: $here = getcwd();
es: $directorio = getcwd();

source: $here = getcwd(); # oops!
es: $directorio= getcwd(); # vaya...

source: $hexdigit = ('a','b','c','d','e','f')[$digit-10];
es: $digitohex = ('a','b','c','d','e','f')[$digito-10];

source: $hours = $1;
es: $horas = $1;

source: $main::name = "barney";
es: $main::nombre = "Pablo";

source: $minutes = $2;
es: $minutos = $2;

source: $mp3->save();
es: $mp3->guardar();

source: $n = "-12.34e56"; # number specified as a string
es: $n = "-12.34e56"; # número especificado como una cadena

source: $n = "1234"; # number specified as a string
es: $n = "1234"; # número especificado como una cadena

source: $n = 01234; # octal integer
es: $n = 01234; # entero octal

source: $n = 0b1110011; # binary integer
es: $n = 0b1110011; # entero binario

source: $n = 0x1234; # hexadecimal integer
es: $n = 0x1234; # entero hexadecimal

source: $n = 12.34e-56; # exponential notation
es: $n = 12.34e-56; # notación exponencial

source: $n = 1234; # decimal integer
es: $n = 1234; # entero decimal

source: $no_caps_here function scope my() or local() variables
es: $sin_mayusculas Variables definidas con my() o local() en un ámbito de función

source: $object->$meth();
es: $objeto->$metodo();

source: $old_filter = $db->filter_fetch_key ( sub { ... } );
es: $filtro_anterior = $db->filter_fetch_key ( sub { ... } );

source: $old_filter = $db->filter_fetch_value( sub { ... } );
es: $filtro_anterior = $db->filter_fetch_value( sub { ... } );

source: $old_filter = $db->filter_store_key ( sub { ... } );
es: $filtro_anterior = $db->filter_store_key ( sub { ... } );

source: $old_filter = $db->filter_store_value( sub { ... } );
es: $filtro_anterior = $db->filter_store_value( sub { ... } );

source: $pattern = "(?i)foobar";
es: $patron = "(?i)foobar";

source: $pattern = "foobar";
es: $patron = "foobar";

source: $pattern =~ s/(\W)/\\$1/g;
es: $patrón =~ s/(\W)/\\$1/g;

source: $pattern =~ s/(\W)/\\\1/g;
es: $patron =~ s/(\W)/\\\1/g;

source: $pod->save();
es: $pod->guardar();

source: $re = customre::convert $re;
es: $re = rxpersonal::convertir $re;

source: $re = qr{ \( (?: (?> [^()]+ ) # Non-parens without backtracking | (??{ $re }) # Group with matching parens )* \) }x;
es: $re = qr{ \( (?: (?> [^()]+ ) # No paréntesis, sin vuelta atrás | (??{ $re }) # Grupo con paréntesis emparejados )* \) }x;

source: $re = qr{ ( # paren group 1 (full function) foo ( # paren group 2 (parens) \( ( # paren group 3 (contents of parens) (?: (?> [^()]+ ) # Non-parens without backtracking | (?2) # Recurse to start of paren group 2 )* ) \) ) ) }x;
es: $re = qr{ ( # grupo de paréntesis 1 (toda la función) foo ( # grupo de paréntesis 2 (paréntesis) \( ( # grupo de paréntesis 2 (contenido de paréntesis) (?: (?> [^()]+ ) # No paréntesis sin vuelta atrás | (?3) # Recursión para iniciar grupo de paréntesis 2 )* ) \) ) ) }x;

source: $re =~ s{ \\ ( \\ | Y . ) } { $rules{$1} or invalid($re,$1) }sgex;
es: $re =~ s{ \\ ( \\ | Y . ) } { $reglas{$1} or no_valido($re,$1) }sgex;

source: $rec = { witch => 'Mable the Merciless', cat => 'Fluffy the Ferocious', date => '10/31/1776',
es: $reg = { bruja => 'La implacable Piruja', gato => 'Fofito Feroz', fecha => '31/10/1776',

source: $seconds = $3;
es: $segundos = $3;

source: $self->SUPER::print_info();
es: $self->SUPER::imprimir_info();

source: $self->SUPER::save();
es: $self->SUPER::guardar();

source: $self->SUPER::speak();
es: $self->SUPER::decir();

source: $self->_initialize();
es: $self->_inicializar();

source: $self->is_on(0);
es: $self->encendido(0);

source: $self->is_on(1);
es: $self->encendido(1);

source: $self->save();
es: $self->guardar();

source: $self->{handle}->close() if $self->{handle};
es: $self->{controlador}->cerrar() if $self->{controlador};

source: $self->{handle}->close();
es: $self->{controlador}->cerrar();

source: $sq = square(8);
es: $sq = cuadrado(8);

source: $str .= "\x{0e0b}"; # Now $str is in UTF-8 format.
es: $str .= "\x{0e0b}"; # Ahora $str está en formato UTF-8.

source: $str = "\xDF"; # $str is not in UTF-8 format.
es: $str = "\xDF"; # $str no está en formato UTF-8.

source: $str =~ /^\w/; # Match!
es: $str =~ /^\w/; # Hay coincidencia.

source: $str =~ /^\w/; # No match, as $str isn't in UTF-8 format.
es: $str =~ /^\w/; # No hay coincidencia porque $str no está en formato UTF-8.

source: $str =~ /^\w/; # Still a match!
es: $str =~ /^\w/; # Sigue habiendo coincidencia.

source: $str is now in UTF-8 format.
es: Ahora $str tiene formato UTF-8.

source: $str remains in UTF-8 format.
es: $str sigue estando en formato UTF-8.

source: $string =~ /$re/;
es: $cadena =~ /$re/;

source: $t = @a[0, 1]; # $t is now 'second'
es: $t = @a[0, 1]; # Ahora $t es 'segundo'

source: $temp = join($", @ARGV);
es: $temporal = join($", @ARGV);

source: $text = ucfirst $text;
es: $texto = ucfirst $texto;

source: $text =~ s/foo/bar/;
es: $texto =~ s/foo/bar/;

source: $thing->SUPER::save(); # Okay: looks for save() method in parent # classes
es: $algo->SUPER::guardar(); # CORRECTO: busca el método guardar() en las # clases primarias

source: $time = (stat($file))[8];
es: $time = (stat($archivo))[8];

source: $time = stat($file)[8]; # OOPS, FORGOT PARENTHESES
es: $acceso = stat($archivo)[8]; # VAYA, OLVIDÓ LOS PARÉNTESIS

source: $time_for{$self} = time;
es: $hora_para{$self} = time;

source: $u = @h{'first', 'second'}; # $u is now 'B'
es: $u = @h{'primero', 'segundo'}; # Ahora $u es 'B'

source: $var = "value";
es: $var = "valor";

# $verbose && print "Starting analysis ";
source: $verbose && print "Starting analysis\n";
es: $verbose && print "Iniciando análisis\n";

source: $who = "Larry";
es: $usuario = "Larry";

source: $x = (($foo,$bar) = (3,2,1)); # set $x to 3, not 2
es: $x = (($foo,$bar) = (3,2,1)); # asigna 3 a $x, no 2

source: $x = (($foo,$bar) = f()); # set $x to f()'s return count
es: $x = (($foo,$bar) = f()); # asigna a $x el número de valores devueltos por f()

source: % git am 0001-Rename-Leon-Brocard-to-Orange-Brocard.patch
es: % git am 0001-Cambiar-nombre-de-Leon-Brocard-a-Orange-Brocard.patch

source: % git commit -a -m "Some fixing" --author="That Guy <that.guy@internets.com>"
es: % git commit -a -m "Corrección" --author="Un colaborador <un.colaborador@internets.com>"

source: % git commit -a -m 'Rename Leon Brocard to Orange Brocard'
es: % git commit -a -m 'Cambio de nombre de Leon Brocard a Orange Brocard'

source: % git config --global user.name "Ãvar ArnfjÃ¶rÃ° Bjarmason"
es: % git config --global user.name "Ævar Arnfjörð Bjarmason"

source: %days # (key1, val1, key2, val2 ...)
es: %jornadas # (clave1, valor1, clave2, valor2 ...)

source: %h = (first => 'A', second => 'B');
es: %h = (primero => 'A', segundo => 'B');

source: %map = ( red => 0x00f, blue => 0x0f0, green => 0xf00,
es: %mapa = ( rojo => 0x00f, azul => 0x0f0, verde => 0xf00,

source: %map = ('red',0x00f,'blue',0x0f0,'green',0xf00);
es: %mapa = ('rojo',0x00f,'azul',0x0f0,'verde',0xf00);

source: %scientists =
es: %cientificos =

source: %some_hash = (); # can't be my()
es: %mi_hash = (); # no puede ser my()

source: && ^ string begin /i case insensitive
es: && ^ principio cadena /i no distinguir may./min.

source: '1' may actually be any positive integer.
es: '1' puede ser cualquier entero positivo.

source: 'Class'->new()
es: 'Clase'->new()

# 'aaab' =~ /a+b?(*PRUNE)(?{print "$& "; $count++})(*FAIL)/;
source: 'aaab' =~ /a+b?(*PRUNE)(?{print "$&\n"; $count++})(*FAIL)/;
es: 'aaab' =~ /a+b?(*PRUNE)(?{print "$&\n"; $contador++})(*FAIL)/;

# 'aaab' =~ /a+b?(?{print "$& "; $count++})(*FAIL)/;
source: 'aaab' =~ /a+b?(?{print "$&\n"; $count++})(*FAIL)/;
es: 'aaab' =~ /a+b?(?{print "$&\n"; $contador++})(*FAIL)/;

# 'aaabaaab' =~ /a+b?(*COMMIT)(?{print "$& "; $count++})(*FAIL)/;
source: 'aaabaaab' =~ /a+b?(*COMMIT)(?{print "$&\n"; $count++})(*FAIL)/;
es: 'aaabaaab' =~ /a+b?(*COMMIT)(?{print "$&\n"; $contador++})(*FAIL)/;

# 'aaabaaab' =~ /a+b?(*SKIP)(?{print "$& "; $count++})(*FAIL)/;
source: 'aaabaaab' =~ /a+b?(*SKIP)(?{print "$&\n"; $count++})(*FAIL)/;
es: 'aaabaaab' =~ /a+b?(*SKIP)(?{print "$&\n"; $contador++})(*FAIL)/;

source: ( (?i) blah ) \s+ \g1
es: ( (?i) bla ) \s+ \g1

source: ($a, $b, @rest) = split;
es: ($a, $b, @resto) = split;

source: ($colors{'red'}, $colors{'blue'}, $colors{'green'}) = (0xff0000, 0x0000ff, 0x00ff00);
es: ($colores{'rojo'}, $colores{'azul'}, $colores{'verde'}) = (0xff0000, 0x0000ff, 0x00ff00);

source: ($days[3], $days[4], $days[5]) = qw/Wed Thu Fri/;
es: ($jornadas[3], $jornadas[4], $jornadas[5]) = qw/Mié Jue Vie/;

source: ($dev, $ino, undef, undef, $uid, $gid) = stat($file);
es: ($dev, $ino, undef, undef, $uid, $gid) = stat($archivo);

source: ($folks[0], $folks[-1]) = ($folks[-1], $folks[0]);
es: ($gente[0], $gente[-1]) = ($gente[-1], $gente[0]);

source: ($him, $her) = @folks[0,-1]; # array slice
es: ($el, $ella) = @gente[0,-1]; # porción de array

source: ($map{'red'}, $map{'blue'}, $map{'green'}) = (0x00f, 0x0f0, 0xf00);
es: ($mapa{'rojo'}, $mapa{'azul'}, $mapa{'verde'}) = (0x00f, 0x0f0, 0xf00);

source: ($uid, $dir) = (getpwnam("daemon"))[2,7]; # list slice
es: ($uid, $dir) = (getpwnam("daemon"))[2,7]; # porción de lista

source: ($whitewashed = $string) =~ s/()/ /g; # parens avoid magic s// /
es: ($muchoespacio = $cadena) =~ s/()/ /g;# los paréntesis evitan la magia de s// /

source: ($who, $home) = @ENV{"USER", "HOME"}; # hash slice
es: ($usuario, $inicio) = @ENV{"USER", "HOME"}; # porción de hash

source: () Grouping
es: () Agrupación

source: (.*)(\d*) <I have 2 numbers: 53147> <>
es: (.*)(\d*) <Tengo 2 números: 53147> <>

source: (.*)(\d+) <I have 2 numbers: 5314> <7>
es: (.*)(\d+) <Tengo 2 números: 5314> <7>

source: (.*)(\d+)$ <I have 2 numbers: 5314> <7>
es: (.*)(\d+)$ <Tengo 2 números: 5314> <7>

source: (.*)\b(\d+)$ <I have 2 numbers: > <53147>
es: (.*)\b(\d+)$ <Tengo 2 números: > <53147>

source: (.*?)(\d+) <I have > <2>
es: (.*?)(\d+) <Tengo > <2>

source: (.*?)(\d+)$ <I have 2 numbers: > <53147>
es: (.*)(\d+)$ <Tengo 2 números: > <53147>

source: (.*\D)(\d+)$ <I have 2 numbers: > <53147>
es: (.*\D)(\d+)$ <Tengo 2 números: > <53147>

source: (?<ADRESS_PAT>....)
es: (?<DIRECCIÓN_PAT>...)

source: (?<NAME_PAT>....)
es: (?<NOMBRE_PAT>...)

source: (?=(b)) # zero-width assertion
es: (?=(b)) # aserción de ancho cero
